---
type: FamilySizeTableErrorInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# FamilySizeTableErrorInfo

`Autodesk.Revit.DB.FamilySizeTableErrorInfo` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FamilySizeTableErrorInfo | 2014 | `public FamilySizeTableErrorInfo ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | FamilySizeTableErrorType | 2014 | `public FamilySizeTableErrorType FamilySizeTableErrorType { get ; }` |
| Property | FilePath | 2014 | `public string FilePath { get ; }` |
| Property | InvalidColumnIndex | 2014 | `public int InvalidColumnIndex { get ; }` |
| Property | InvalidHeaderText | 2014 | `public string InvalidHeaderText { get ; }` |
| Property | InvalidRowIndex | 2014 | `public int InvalidRowIndex { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |